SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_rac.h
/* Bit fields for RAC PATRIM0 */
#define _RAC_PATRIM0_RESETVALUE                                       0x00000077UL                                        /**< Default value for RAC_PATRIM0               */
#define _RAC_PATRIM0_MASK                                             0x0101FFFFUL                                        /**< Mask for RAC_PATRIM0                        */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_SHIFT                            0                                                   /**< Shift value for RAC_TX0DBMTRIMBIASN         */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_MASK                             0xFUL                                               /**< Bit mask for RAC_TX0DBMTRIMBIASN            */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_DEFAULT                          0x00000007UL                                        /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_367m                           0x00000000UL                                        /**< Mode v_367m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_380m                           0x00000001UL                                        /**< Mode v_380m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_393m                           0x00000002UL                                        /**< Mode v_393m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_406m                           0x00000003UL                                        /**< Mode v_406m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_419m                           0x00000004UL                                        /**< Mode v_419m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_432m                           0x00000005UL                                        /**< Mode v_432m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_445m                           0x00000006UL                                        /**< Mode v_445m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_default_458m                   0x00000007UL                                        /**< Mode v_default_458m for RAC_PATRIM0         */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_483m                           0x00000008UL                                        /**< Mode v_483m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_496m                           0x00000009UL                                        /**< Mode v_496m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_509m                           0x0000000AUL                                        /**< Mode v_509m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_522m                           0x0000000BUL                                        /**< Mode v_522m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_535m                           0x0000000CUL                                        /**< Mode v_535m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_548m                           0x0000000DUL                                        /**< Mode v_548m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_561m                           0x0000000EUL                                        /**< Mode v_561m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASN_v_574m                           0x0000000FUL                                        /**< Mode v_574m for RAC_PATRIM0                 */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_DEFAULT                           (_RAC_PATRIM0_TX0DBMTRIMBIASN_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_367m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_367m << 0)          /**< Shifted mode v_367m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_380m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_380m << 0)          /**< Shifted mode v_380m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_393m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_393m << 0)          /**< Shifted mode v_393m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_406m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_406m << 0)          /**< Shifted mode v_406m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_419m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_419m << 0)          /**< Shifted mode v_419m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_432m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_432m << 0)          /**< Shifted mode v_432m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_445m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_445m << 0)          /**< Shifted mode v_445m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_default_458m                    (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_default_458m << 0)  /**< Shifted mode v_default_458m for RAC_PATRIM0 */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_483m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_483m << 0)          /**< Shifted mode v_483m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_496m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_496m << 0)          /**< Shifted mode v_496m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_509m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_509m << 0)          /**< Shifted mode v_509m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_522m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_522m << 0)          /**< Shifted mode v_522m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_535m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_535m << 0)          /**< Shifted mode v_535m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_548m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_548m << 0)          /**< Shifted mode v_548m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_561m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_561m << 0)          /**< Shifted mode v_561m for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASN_v_574m                            (_RAC_PATRIM0_TX0DBMTRIMBIASN_v_574m << 0)          /**< Shifted mode v_574m for RAC_PATRIM0         */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_SHIFT                            4                                                   /**< Shift value for RAC_TX0DBMTRIMBIASP         */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_MASK                             0xF0UL                                              /**< Bit mask for RAC_TX0DBMTRIMBIASP            */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_DEFAULT                          0x00000007UL                                        /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p186                          0x00000000UL                                        /**< Mode v_1p186 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p173                          0x00000001UL                                        /**< Mode v_1p173 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p16                           0x00000002UL                                        /**< Mode v_1p16 for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p147                          0x00000003UL                                        /**< Mode v_1p147 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p134                          0x00000004UL                                        /**< Mode v_1p134 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p121                          0x00000005UL                                        /**< Mode v_1p121 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p108                          0x00000006UL                                        /**< Mode v_1p108 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_default_1p095                  0x00000007UL                                        /**< Mode v_default_1p095 for RAC_PATRIM0        */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p083                          0x00000008UL                                        /**< Mode v_1p083 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p07                           0x00000009UL                                        /**< Mode v_1p07 for RAC_PATRIM0                 */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p057                          0x0000000AUL                                        /**< Mode v_1p057 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p044                          0x0000000BUL                                        /**< Mode v_1p044 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p031                          0x0000000CUL                                        /**< Mode v_1p031 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p019                          0x0000000DUL                                        /**< Mode v_1p019 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p006                          0x0000000EUL                                        /**< Mode v_1p006 for RAC_PATRIM0                */
#define _RAC_PATRIM0_TX0DBMTRIMBIASP_v_0p993                          0x0000000FUL                                        /**< Mode v_0p993 for RAC_PATRIM0                */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_DEFAULT                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_DEFAULT << 4)         /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p186                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p186 << 4)         /**< Shifted mode v_1p186 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p173                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p173 << 4)         /**< Shifted mode v_1p173 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p16                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p16 << 4)          /**< Shifted mode v_1p16 for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p147                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p147 << 4)         /**< Shifted mode v_1p147 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p134                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p134 << 4)         /**< Shifted mode v_1p134 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p121                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p121 << 4)         /**< Shifted mode v_1p121 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p108                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p108 << 4)         /**< Shifted mode v_1p108 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_default_1p095                   (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_default_1p095 << 4) /**< Shifted mode v_default_1p095 for RAC_PATRIM0*/
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p083                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p083 << 4)         /**< Shifted mode v_1p083 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p07                            (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p07 << 4)          /**< Shifted mode v_1p07 for RAC_PATRIM0         */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p057                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p057 << 4)         /**< Shifted mode v_1p057 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p044                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p044 << 4)         /**< Shifted mode v_1p044 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p031                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p031 << 4)         /**< Shifted mode v_1p031 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p019                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p019 << 4)         /**< Shifted mode v_1p019 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p006                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_1p006 << 4)         /**< Shifted mode v_1p006 for RAC_PATRIM0        */
#define RAC_PATRIM0_TX0DBMTRIMBIASP_v_0p993                           (_RAC_PATRIM0_TX0DBMTRIMBIASP_v_0p993 << 4)         /**< Shifted mode v_0p993 for RAC_PATRIM0        */
#define _RAC_PATRIM0_TXPAAMPCTRL_SHIFT                                8                                                   /**< Shift value for RAC_TXPAAMPCTRL             */
#define _RAC_PATRIM0_TXPAAMPCTRL_MASK                                 0xFF00UL                                            /**< Bit mask for RAC_TXPAAMPCTRL                */
#define _RAC_PATRIM0_TXPAAMPCTRL_DEFAULT                              0x00000000UL                                        /**< Mode DEFAULT for RAC_PATRIM0                */
#define RAC_PATRIM0_TXPAAMPCTRL_DEFAULT                               (_RAC_PATRIM0_TXPAAMPCTRL_DEFAULT << 8)             /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TXPABYPASSREG                                     (0x1UL << 16)                                       /**< TXPABYPASSREG                               */
#define _RAC_PATRIM0_TXPABYPASSREG_SHIFT                              16                                                  /**< Shift value for RAC_TXPABYPASSREG           */
#define _RAC_PATRIM0_TXPABYPASSREG_MASK                               0x10000UL                                           /**< Bit mask for RAC_TXPABYPASSREG              */
#define _RAC_PATRIM0_TXPABYPASSREG_DEFAULT                            0x00000000UL                                        /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_TXPABYPASSREG_not_bypass                         0x00000000UL                                        /**< Mode not_bypass for RAC_PATRIM0             */
#define _RAC_PATRIM0_TXPABYPASSREG_bypass                             0x00000001UL                                        /**< Mode bypass for RAC_PATRIM0                 */
#define RAC_PATRIM0_TXPABYPASSREG_DEFAULT                             (_RAC_PATRIM0_TXPABYPASSREG_DEFAULT << 16)          /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_TXPABYPASSREG_not_bypass                          (_RAC_PATRIM0_TXPABYPASSREG_not_bypass << 16)       /**< Shifted mode not_bypass for RAC_PATRIM0     */
#define RAC_PATRIM0_TXPABYPASSREG_bypass                              (_RAC_PATRIM0_TXPABYPASSREG_bypass << 16)           /**< Shifted mode bypass for RAC_PATRIM0         */
#define RAC_PATRIM0_ENAMPCTRLREG                                      (0x1UL << 24)                                       /**< ENAMPCTRLREG                                */
#define _RAC_PATRIM0_ENAMPCTRLREG_SHIFT                               24                                                  /**< Shift value for RAC_ENAMPCTRLREG            */
#define _RAC_PATRIM0_ENAMPCTRLREG_MASK                                0x1000000UL                                         /**< Bit mask for RAC_ENAMPCTRLREG               */
#define _RAC_PATRIM0_ENAMPCTRLREG_DEFAULT                             0x00000000UL                                        /**< Mode DEFAULT for RAC_PATRIM0                */
#define RAC_PATRIM0_ENAMPCTRLREG_DEFAULT                              (_RAC_PATRIM0_ENAMPCTRLREG_DEFAULT << 24)           /**< Shifted mode DEFAULT for RAC_PATRIM0        */

