SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_rac.h
/* Bit fields for RAC PATRIM3 */
#define _RAC_PATRIM3_RESETVALUE                                       0x008D33AAUL                                             /**< Default value for RAC_PATRIM3               */
#define _RAC_PATRIM3_MASK                                             0x00FF73FEUL                                             /**< Mask for RAC_PATRIM3                        */
#define RAC_PATRIM3_TXPATRIMBLEEDAUTOREG                              (0x1UL << 1)                                             /**< TXPATRIMBLEEDAUTOREG                        */
#define _RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_SHIFT                       1                                                        /**< Shift value for RAC_TXPATRIMBLEEDAUTOREG    */
#define _RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_MASK                        0x2UL                                                    /**< Bit mask for RAC_TXPATRIMBLEEDAUTOREG       */
#define _RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_DEFAULT                     0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_not_automatic               0x00000000UL                                             /**< Mode not_automatic for RAC_PATRIM3          */
#define _RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_automatic                   0x00000001UL                                             /**< Mode automatic for RAC_PATRIM3              */
#define RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_DEFAULT                      (_RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_DEFAULT << 1)         /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_not_automatic                (_RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_not_automatic << 1)   /**< Shifted mode not_automatic for RAC_PATRIM3  */
#define RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_automatic                    (_RAC_PATRIM3_TXPATRIMBLEEDAUTOREG_automatic << 1)       /**< Shifted mode automatic for RAC_PATRIM3      */
#define _RAC_PATRIM3_TXPATRIMIBIASMASTER_SHIFT                        2                                                        /**< Shift value for RAC_TXPATRIMIBIASMASTER     */
#define _RAC_PATRIM3_TXPATRIMIBIASMASTER_MASK                         0xCUL                                                    /**< Bit mask for RAC_TXPATRIMIBIASMASTER        */
#define _RAC_PATRIM3_TXPATRIMIBIASMASTER_DEFAULT                      0x00000002UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_45u                 0x00000000UL                                             /**< Mode Ibias_is_45u for RAC_PATRIM3           */
#define _RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_47p5u               0x00000001UL                                             /**< Mode Ibias_is_47p5u for RAC_PATRIM3         */
#define _RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_50u                 0x00000002UL                                             /**< Mode Ibias_is_50u for RAC_PATRIM3           */
#define _RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_52p5u               0x00000003UL                                             /**< Mode Ibias_is_52p5u for RAC_PATRIM3         */
#define RAC_PATRIM3_TXPATRIMIBIASMASTER_DEFAULT                       (_RAC_PATRIM3_TXPATRIMIBIASMASTER_DEFAULT << 2)          /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_45u                  (_RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_45u << 2)     /**< Shifted mode Ibias_is_45u for RAC_PATRIM3   */
#define RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_47p5u                (_RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_47p5u << 2)   /**< Shifted mode Ibias_is_47p5u for RAC_PATRIM3 */
#define RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_50u                  (_RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_50u << 2)     /**< Shifted mode Ibias_is_50u for RAC_PATRIM3   */
#define RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_52p5u                (_RAC_PATRIM3_TXPATRIMIBIASMASTER_Ibias_is_52p5u << 2)   /**< Shifted mode Ibias_is_52p5u for RAC_PATRIM3 */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFB_SHIFT                        4                                                        /**< Shift value for RAC_TXPATRIMPREDRVREGFB     */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFB_MASK                         0x30UL                                                   /**< Bit mask for RAC_TXPATRIMPREDRVREGFB        */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFB_DEFAULT                      0x00000002UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p22                    0x00000000UL                                             /**< Mode vreg_1p22 for RAC_PATRIM3              */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p28                    0x00000001UL                                             /**< Mode vreg_1p28 for RAC_PATRIM3              */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p35                    0x00000002UL                                             /**< Mode vreg_1p35 for RAC_PATRIM3              */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p44                    0x00000003UL                                             /**< Mode vreg_1p44 for RAC_PATRIM3              */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFB_DEFAULT                       (_RAC_PATRIM3_TXPATRIMPREDRVREGFB_DEFAULT << 4)          /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p22                     (_RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p22 << 4)        /**< Shifted mode vreg_1p22 for RAC_PATRIM3      */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p28                     (_RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p28 << 4)        /**< Shifted mode vreg_1p28 for RAC_PATRIM3      */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p35                     (_RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p35 << 4)        /**< Shifted mode vreg_1p35 for RAC_PATRIM3      */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p44                     (_RAC_PATRIM3_TXPATRIMPREDRVREGFB_vreg_1p44 << 4)        /**< Shifted mode vreg_1p44 for RAC_PATRIM3      */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT                           (0x1UL << 6)                                             /**< TXPATRIMPREDRVREGFBKATT                     */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_SHIFT                    6                                                        /**< Shift value for RAC_TXPATRIMPREDRVREGFBKATT */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_MASK                     0x40UL                                                   /**< Bit mask for RAC_TXPATRIMPREDRVREGFBKATT    */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_DEFAULT                  0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_less_bw                  0x00000000UL                                             /**< Mode less_bw for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_more_bw                  0x00000001UL                                             /**< Mode more_bw for RAC_PATRIM3                */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_DEFAULT                   (_RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_less_bw                   (_RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_less_bw << 6)      /**< Shifted mode less_bw for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_more_bw                   (_RAC_PATRIM3_TXPATRIMPREDRVREGFBKATT_more_bw << 6)      /**< Shifted mode more_bw for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGPSR                              (0x1UL << 7)                                             /**< TXPATRIMPREDRVREGPSR                        */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGPSR_SHIFT                       7                                                        /**< Shift value for RAC_TXPATRIMPREDRVREGPSR    */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGPSR_MASK                        0x80UL                                                   /**< Bit mask for RAC_TXPATRIMPREDRVREGPSR       */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGPSR_DEFAULT                     0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGPSR_low_psr                     0x00000000UL                                             /**< Mode low_psr for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGPSR_high_psr                    0x00000001UL                                             /**< Mode high_psr for RAC_PATRIM3               */
#define RAC_PATRIM3_TXPATRIMPREDRVREGPSR_DEFAULT                      (_RAC_PATRIM3_TXPATRIMPREDRVREGPSR_DEFAULT << 7)         /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGPSR_low_psr                      (_RAC_PATRIM3_TXPATRIMPREDRVREGPSR_low_psr << 7)         /**< Shifted mode low_psr for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGPSR_high_psr                     (_RAC_PATRIM3_TXPATRIMPREDRVREGPSR_high_psr << 7)        /**< Shifted mode high_psr for RAC_PATRIM3       */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_SHIFT                    8                                                        /**< Shift value for RAC_TXPATRIMPREDRVREGSLICES */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_MASK                     0x300UL                                                  /**< Bit mask for RAC_TXPATRIMPREDRVREGSLICES    */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_DEFAULT                  0x00000003UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_7p5mA              0x00000000UL                                             /**< Mode iload_7p5mA for RAC_PATRIM3            */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_15mA               0x00000001UL                                             /**< Mode iload_15mA for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_22p5mA             0x00000002UL                                             /**< Mode iload_22p5mA for RAC_PATRIM3           */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_30mA               0x00000003UL                                             /**< Mode iload_30mA for RAC_PATRIM3             */
#define RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_DEFAULT                   (_RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_DEFAULT << 8)      /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_7p5mA               (_RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_7p5mA << 8)  /**< Shifted mode iload_7p5mA for RAC_PATRIM3    */
#define RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_15mA                (_RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_15mA << 8)   /**< Shifted mode iload_15mA for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_22p5mA              (_RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_22p5mA << 8) /**< Shifted mode iload_22p5mA for RAC_PATRIM3   */
#define RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_30mA                (_RAC_PATRIM3_TXPATRIMPREDRVREGSLICES_iload_30mA << 8)   /**< Shifted mode iload_30mA for RAC_PATRIM3     */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_SHIFT                      12                                                       /**< Shift value for RAC_TXPATRIMPREDRVREGVREF   */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_MASK                       0x7000UL                                                 /**< Bit mask for RAC_TXPATRIMPREDRVREGVREF      */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_DEFAULT                    0x00000003UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p675                 0x00000000UL                                             /**< Mode vref_0p675 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p700                 0x00000001UL                                             /**< Mode vref_0p700 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p725                 0x00000002UL                                             /**< Mode vref_0p725 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p750                 0x00000003UL                                             /**< Mode vref_0p750 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p775                 0x00000004UL                                             /**< Mode vref_0p775 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p800                 0x00000005UL                                             /**< Mode vref_0p800 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p825                 0x00000006UL                                             /**< Mode vref_0p825 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p850                 0x00000007UL                                             /**< Mode vref_0p850 for RAC_PATRIM3             */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_DEFAULT                     (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_DEFAULT << 12)       /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p675                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p675 << 12)    /**< Shifted mode vref_0p675 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p700                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p700 << 12)    /**< Shifted mode vref_0p700 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p725                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p725 << 12)    /**< Shifted mode vref_0p725 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p750                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p750 << 12)    /**< Shifted mode vref_0p750 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p775                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p775 << 12)    /**< Shifted mode vref_0p775 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p800                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p800 << 12)    /**< Shifted mode vref_0p800 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p825                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p825 << 12)    /**< Shifted mode vref_0p825 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p850                  (_RAC_PATRIM3_TXPATRIMPREDRVREGVREF_vref_0p850 << 12)    /**< Shifted mode vref_0p850 for RAC_PATRIM3     */
#define _RAC_PATRIM3_TXPATRIMREGFB_SHIFT                              16                                                       /**< Shift value for RAC_TXPATRIMREGFB           */
#define _RAC_PATRIM3_TXPATRIMREGFB_MASK                               0x70000UL                                                /**< Bit mask for RAC_TXPATRIMREGFB              */
#define _RAC_PATRIM3_TXPATRIMREGFB_DEFAULT                            0x00000005UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_1p678                         0x00000000UL                                             /**< Mode vreg_1p678 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_1p735                         0x00000001UL                                             /**< Mode vreg_1p735 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_1p801                         0x00000002UL                                             /**< Mode vreg_1p801 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_1p875                         0x00000003UL                                             /**< Mode vreg_1p875 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_3p00                          0x00000004UL                                             /**< Mode vreg_3p00 for RAC_PATRIM3              */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_3p14                          0x00000005UL                                             /**< Mode vreg_3p14 for RAC_PATRIM3              */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_3p3                           0x00000006UL                                             /**< Mode vreg_3p3 for RAC_PATRIM3               */
#define _RAC_PATRIM3_TXPATRIMREGFB_vreg_3p477                         0x00000007UL                                             /**< Mode vreg_3p477 for RAC_PATRIM3             */
#define RAC_PATRIM3_TXPATRIMREGFB_DEFAULT                             (_RAC_PATRIM3_TXPATRIMREGFB_DEFAULT << 16)               /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_1p678                          (_RAC_PATRIM3_TXPATRIMREGFB_vreg_1p678 << 16)            /**< Shifted mode vreg_1p678 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_1p735                          (_RAC_PATRIM3_TXPATRIMREGFB_vreg_1p735 << 16)            /**< Shifted mode vreg_1p735 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_1p801                          (_RAC_PATRIM3_TXPATRIMREGFB_vreg_1p801 << 16)            /**< Shifted mode vreg_1p801 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_1p875                          (_RAC_PATRIM3_TXPATRIMREGFB_vreg_1p875 << 16)            /**< Shifted mode vreg_1p875 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_3p00                           (_RAC_PATRIM3_TXPATRIMREGFB_vreg_3p00 << 16)             /**< Shifted mode vreg_3p00 for RAC_PATRIM3      */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_3p14                           (_RAC_PATRIM3_TXPATRIMREGFB_vreg_3p14 << 16)             /**< Shifted mode vreg_3p14 for RAC_PATRIM3      */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_3p3                            (_RAC_PATRIM3_TXPATRIMREGFB_vreg_3p3 << 16)              /**< Shifted mode vreg_3p3 for RAC_PATRIM3       */
#define RAC_PATRIM3_TXPATRIMREGFB_vreg_3p477                          (_RAC_PATRIM3_TXPATRIMREGFB_vreg_3p477 << 16)            /**< Shifted mode vreg_3p477 for RAC_PATRIM3     */
#define RAC_PATRIM3_TXPATRIMREGPSR                                    (0x1UL << 19)                                            /**< TXPATRIMREGPSR                              */
#define _RAC_PATRIM3_TXPATRIMREGPSR_SHIFT                             19                                                       /**< Shift value for RAC_TXPATRIMREGPSR          */
#define _RAC_PATRIM3_TXPATRIMREGPSR_MASK                              0x80000UL                                                /**< Bit mask for RAC_TXPATRIMREGPSR             */
#define _RAC_PATRIM3_TXPATRIMREGPSR_DEFAULT                           0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMREGPSR_low_psr                           0x00000000UL                                             /**< Mode low_psr for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMREGPSR_high_psr                          0x00000001UL                                             /**< Mode high_psr for RAC_PATRIM3               */
#define RAC_PATRIM3_TXPATRIMREGPSR_DEFAULT                            (_RAC_PATRIM3_TXPATRIMREGPSR_DEFAULT << 19)              /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMREGPSR_low_psr                            (_RAC_PATRIM3_TXPATRIMREGPSR_low_psr << 19)              /**< Shifted mode low_psr for RAC_PATRIM3        */
#define RAC_PATRIM3_TXPATRIMREGPSR_high_psr                           (_RAC_PATRIM3_TXPATRIMREGPSR_high_psr << 19)             /**< Shifted mode high_psr for RAC_PATRIM3       */
#define _RAC_PATRIM3_TXPATRIMREGVREF_SHIFT                            20                                                       /**< Shift value for RAC_TXPATRIMREGVREF         */
#define _RAC_PATRIM3_TXPATRIMREGVREF_MASK                             0xF00000UL                                               /**< Bit mask for RAC_TXPATRIMREGVREF            */
#define _RAC_PATRIM3_TXPATRIMREGVREF_DEFAULT                          0x00000008UL                                             /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p651                       0x00000000UL                                             /**< Mode vref_0p651 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p663                       0x00000001UL                                             /**< Mode vref_0p663 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p676                       0x00000002UL                                             /**< Mode vref_0p676 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p688                       0x00000003UL                                             /**< Mode vref_0p688 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p701                       0x00000004UL                                             /**< Mode vref_0p701 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p713                       0x00000005UL                                             /**< Mode vref_0p713 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p726                       0x00000006UL                                             /**< Mode vref_0p726 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p738                       0x00000007UL                                             /**< Mode vref_0p738 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p751                       0x00000008UL                                             /**< Mode vref_0p751 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p763                       0x00000009UL                                             /**< Mode vref_0p763 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p776                       0x0000000AUL                                             /**< Mode vref_0p776 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p788                       0x0000000BUL                                             /**< Mode vref_0p788 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p801                       0x0000000CUL                                             /**< Mode vref_0p801 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p813                       0x0000000DUL                                             /**< Mode vref_0p813 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p826                       0x0000000EUL                                             /**< Mode vref_0p826 for RAC_PATRIM3             */
#define _RAC_PATRIM3_TXPATRIMREGVREF_vref_0p838                       0x0000000FUL                                             /**< Mode vref_0p838 for RAC_PATRIM3             */
