SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_rac.h
/* Bit fields for RAC TXRAMP */
#define _RAC_TXRAMP_RESETVALUE                                        0x00000000UL                          /**< Default value for RAC_TXRAMP                */
#define _RAC_TXRAMP_MASK                                              0x00000001UL                          /**< Mask for RAC_TXRAMP                         */
#define RAC_TXRAMP_PARAMPMODE                                         (0x1UL << 0)                          /**< PARAMPMODE                                  */
#define _RAC_TXRAMP_PARAMPMODE_SHIFT                                  0                                     /**< Shift value for RAC_PARAMPMODE              */
#define _RAC_TXRAMP_PARAMPMODE_MASK                                   0x1UL                                 /**< Bit mask for RAC_PARAMPMODE                 */
#define _RAC_TXRAMP_PARAMPMODE_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_TXRAMP                 */
#define RAC_TXRAMP_PARAMPMODE_DEFAULT                                 (_RAC_TXRAMP_PARAMPMODE_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_TXRAMP         */

/* Bit fields for RAC PGATRIM */
#define _RAC_PGATRIM_RESETVALUE                                       0x00000B15UL                                  /**< Default value for RAC_PGATRIM               */
#define _RAC_PGATRIM_MASK                                             0x00000FDFUL                                  /**< Mask for RAC_PGATRIM                        */
#define _RAC_PGATRIM_PGACTUNE_SHIFT                                   0                                             /**< Shift value for RAC_PGACTUNE                */
#define _RAC_PGATRIM_PGACTUNE_MASK                                    0x1FUL                                        /**< Bit mask for RAC_PGACTUNE                   */
#define _RAC_PGATRIM_PGACTUNE_DEFAULT                                 0x00000015UL                                  /**< Mode DEFAULT for RAC_PGATRIM                */
#define RAC_PGATRIM_PGACTUNE_DEFAULT                                  (_RAC_PGATRIM_PGACTUNE_DEFAULT << 0)          /**< Shifted mode DEFAULT for RAC_PGATRIM        */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_SHIFT                              6                                             /**< Shift value for RAC_PGAVCMOUTTRIM           */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_MASK                               0x1C0UL                                       /**< Bit mask for RAC_PGAVCMOUTTRIM              */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_DEFAULT                            0x00000004UL                                  /**< Mode DEFAULT for RAC_PGATRIM                */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_475                        0x00000000UL                                  /**< Mode vcm_out_475 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_500                        0x00000001UL                                  /**< Mode vcm_out_500 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_525                        0x00000002UL                                  /**< Mode vcm_out_525 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_550                        0x00000003UL                                  /**< Mode vcm_out_550 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_575                        0x00000004UL                                  /**< Mode vcm_out_575 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_600                        0x00000005UL                                  /**< Mode vcm_out_600 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_625                        0x00000006UL                                  /**< Mode vcm_out_625 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_650                        0x00000007UL                                  /**< Mode vcm_out_650 for RAC_PGATRIM            */
#define RAC_PGATRIM_PGAVCMOUTTRIM_DEFAULT                             (_RAC_PGATRIM_PGAVCMOUTTRIM_DEFAULT << 6)     /**< Shifted mode DEFAULT for RAC_PGATRIM        */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_475                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_475 << 6) /**< Shifted mode vcm_out_475 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_500                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_500 << 6) /**< Shifted mode vcm_out_500 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_525                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_525 << 6) /**< Shifted mode vcm_out_525 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_550                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_550 << 6) /**< Shifted mode vcm_out_550 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_575                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_575 << 6) /**< Shifted mode vcm_out_575 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_600                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_600 << 6) /**< Shifted mode vcm_out_600 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_625                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_625 << 6) /**< Shifted mode vcm_out_625 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_650                         (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_650 << 6) /**< Shifted mode vcm_out_650 for RAC_PGATRIM    */
#define _RAC_PGATRIM_PGAVLDOTRIM_SHIFT                                9                                             /**< Shift value for RAC_PGAVLDOTRIM             */
#define _RAC_PGATRIM_PGAVLDOTRIM_MASK                                 0xE00UL                                       /**< Bit mask for RAC_PGAVLDOTRIM                */
#define _RAC_PGATRIM_PGAVLDOTRIM_DEFAULT                              0x00000005UL                                  /**< Mode DEFAULT for RAC_PGATRIM                */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1225                            0x00000000UL                                  /**< Mode vdda_1225 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1250                            0x00000001UL                                  /**< Mode vdda_1250 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1275                            0x00000002UL                                  /**< Mode vdda_1275 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1300                            0x00000003UL                                  /**< Mode vdda_1300 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1325                            0x00000004UL                                  /**< Mode vdda_1325 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1350                            0x00000005UL                                  /**< Mode vdda_1350 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1375                            0x00000006UL                                  /**< Mode vdda_1375 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1400                            0x00000007UL                                  /**< Mode vdda_1400 for RAC_PGATRIM              */
#define RAC_PGATRIM_PGAVLDOTRIM_DEFAULT                               (_RAC_PGATRIM_PGAVLDOTRIM_DEFAULT << 9)       /**< Shifted mode DEFAULT for RAC_PGATRIM        */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1225                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1225 << 9)     /**< Shifted mode vdda_1225 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1250                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1250 << 9)     /**< Shifted mode vdda_1250 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1275                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1275 << 9)     /**< Shifted mode vdda_1275 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1300                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1300 << 9)     /**< Shifted mode vdda_1300 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1325                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1325 << 9)     /**< Shifted mode vdda_1325 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1350                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1350 << 9)     /**< Shifted mode vdda_1350 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1375                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1375 << 9)     /**< Shifted mode vdda_1375 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1400                             (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1400 << 9)     /**< Shifted mode vdda_1400 for RAC_PGATRIM      */

/* Bit fields for RAC PGACAL */
#define _RAC_PGACAL_RESETVALUE                                        0x00002020UL                          /**< Default value for RAC_PGACAL                */
#define _RAC_PGACAL_MASK                                              0x00003F3FUL                          /**< Mask for RAC_PGACAL                         */
#define _RAC_PGACAL_PGAOFFCALI_SHIFT                                  0                                     /**< Shift value for RAC_PGAOFFCALI              */
#define _RAC_PGACAL_PGAOFFCALI_MASK                                   0x3FUL                                /**< Bit mask for RAC_PGAOFFCALI                 */
#define _RAC_PGACAL_PGAOFFCALI_DEFAULT                                0x00000020UL                          /**< Mode DEFAULT for RAC_PGACAL                 */
#define RAC_PGACAL_PGAOFFCALI_DEFAULT                                 (_RAC_PGACAL_PGAOFFCALI_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_PGACAL         */
#define _RAC_PGACAL_PGAOFFCALQ_SHIFT                                  8                                     /**< Shift value for RAC_PGAOFFCALQ              */
#define _RAC_PGACAL_PGAOFFCALQ_MASK                                   0x3F00UL                              /**< Bit mask for RAC_PGAOFFCALQ                 */
#define _RAC_PGACAL_PGAOFFCALQ_DEFAULT                                0x00000020UL                          /**< Mode DEFAULT for RAC_PGACAL                 */
#define RAC_PGACAL_PGAOFFCALQ_DEFAULT                                 (_RAC_PGACAL_PGAOFFCALQ_DEFAULT << 8) /**< Shifted mode DEFAULT for RAC_PGACAL         */

