SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_rac.h
/* Bit fields for RAC TX */
#define _RAC_TX_RESETVALUE                                            0x00000000UL                                      /**< Default value for RAC_TX                    */
#define _RAC_TX_MASK                                                  0xFFFFF7EFUL                                      /**< Mask for RAC_TX                             */
#define RAC_TX_TXPAENREG                                              (0x1UL << 0)                                      /**< TXPAENREG                                   */
#define _RAC_TX_TXPAENREG_SHIFT                                       0                                                 /**< Shift value for RAC_TXPAENREG               */
#define _RAC_TX_TXPAENREG_MASK                                        0x1UL                                             /**< Bit mask for RAC_TXPAENREG                  */
#define _RAC_TX_TXPAENREG_DEFAULT                                     0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAENREG_disable                                     0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAENREG_enable                                      0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAENREG_DEFAULT                                      (_RAC_TX_TXPAENREG_DEFAULT << 0)                  /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAENREG_disable                                      (_RAC_TX_TXPAENREG_disable << 0)                  /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAENREG_enable                                       (_RAC_TX_TXPAENREG_enable << 0)                   /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAENRAMPCLK                                          (0x1UL << 1)                                      /**< TXPAENRAMPCLK                               */
#define _RAC_TX_TXPAENRAMPCLK_SHIFT                                   1                                                 /**< Shift value for RAC_TXPAENRAMPCLK           */
#define _RAC_TX_TXPAENRAMPCLK_MASK                                    0x2UL                                             /**< Bit mask for RAC_TXPAENRAMPCLK              */
#define _RAC_TX_TXPAENRAMPCLK_DEFAULT                                 0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAENRAMPCLK_silence_clk                             0x00000000UL                                      /**< Mode silence_clk for RAC_TX                 */
#define _RAC_TX_TXPAENRAMPCLK_en_clk                                  0x00000001UL                                      /**< Mode en_clk for RAC_TX                      */
#define RAC_TX_TXPAENRAMPCLK_DEFAULT                                  (_RAC_TX_TXPAENRAMPCLK_DEFAULT << 1)              /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAENRAMPCLK_silence_clk                              (_RAC_TX_TXPAENRAMPCLK_silence_clk << 1)          /**< Shifted mode silence_clk for RAC_TX         */
#define RAC_TX_TXPAENRAMPCLK_en_clk                                   (_RAC_TX_TXPAENRAMPCLK_en_clk << 1)               /**< Shifted mode en_clk for RAC_TX              */
#define RAC_TX_TX0DBMENBLEEDREG                                       (0x1UL << 2)                                      /**< TX0DBMENBLEEDREG                            */
#define _RAC_TX_TX0DBMENBLEEDREG_SHIFT                                2                                                 /**< Shift value for RAC_TX0DBMENBLEEDREG        */
#define _RAC_TX_TX0DBMENBLEEDREG_MASK                                 0x4UL                                             /**< Bit mask for RAC_TX0DBMENBLEEDREG           */
#define _RAC_TX_TX0DBMENBLEEDREG_DEFAULT                              0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDREG_disable                              0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDREG_enable                               0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENBLEEDREG_DEFAULT                               (_RAC_TX_TX0DBMENBLEEDREG_DEFAULT << 2)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDREG_disable                               (_RAC_TX_TX0DBMENBLEEDREG_disable << 2)           /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDREG_enable                                (_RAC_TX_TX0DBMENBLEEDREG_enable << 2)            /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENREG                                            (0x1UL << 3)                                      /**< TX0DBMENREG                                 */
#define _RAC_TX_TX0DBMENREG_SHIFT                                     3                                                 /**< Shift value for RAC_TX0DBMENREG             */
#define _RAC_TX_TX0DBMENREG_MASK                                      0x8UL                                             /**< Bit mask for RAC_TX0DBMENREG                */
#define _RAC_TX_TX0DBMENREG_DEFAULT                                   0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENREG_disable                                   0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENREG_enable                                    0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENREG_DEFAULT                                    (_RAC_TX_TX0DBMENREG_DEFAULT << 3)                /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENREG_disable                                    (_RAC_TX_TX0DBMENREG_disable << 3)                /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENREG_enable                                     (_RAC_TX_TX0DBMENREG_enable << 3)                 /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENBIAS                                           (0x1UL << 5)                                      /**< TX0DBMENBIAS                                */
#define _RAC_TX_TX0DBMENBIAS_SHIFT                                    5                                                 /**< Shift value for RAC_TX0DBMENBIAS            */
#define _RAC_TX_TX0DBMENBIAS_MASK                                     0x20UL                                            /**< Bit mask for RAC_TX0DBMENBIAS               */
#define _RAC_TX_TX0DBMENBIAS_DEFAULT                                  0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENBIAS_disable                                  0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENBIAS_enable                                   0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENBIAS_DEFAULT                                   (_RAC_TX_TX0DBMENBIAS_DEFAULT << 5)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENBIAS_disable                                   (_RAC_TX_TX0DBMENBIAS_disable << 5)               /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENBIAS_enable                                    (_RAC_TX_TX0DBMENBIAS_enable << 5)                /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENPREDRV                                         (0x1UL << 6)                                      /**< TX0DBMENPREDRV                              */
#define _RAC_TX_TX0DBMENPREDRV_SHIFT                                  6                                                 /**< Shift value for RAC_TX0DBMENPREDRV          */
#define _RAC_TX_TX0DBMENPREDRV_MASK                                   0x40UL                                            /**< Bit mask for RAC_TX0DBMENPREDRV             */
#define _RAC_TX_TX0DBMENPREDRV_DEFAULT                                0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRV_disable                                0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRV_enable                                 0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENPREDRV_DEFAULT                                 (_RAC_TX_TX0DBMENPREDRV_DEFAULT << 6)             /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRV_disable                                 (_RAC_TX_TX0DBMENPREDRV_disable << 6)             /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRV_enable                                  (_RAC_TX_TX0DBMENPREDRV_enable << 6)              /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENPREDRVREG                                      (0x1UL << 7)                                      /**< TX0DBMENPREDRVREG                           */
#define _RAC_TX_TX0DBMENPREDRVREG_SHIFT                               7                                                 /**< Shift value for RAC_TX0DBMENPREDRVREG       */
#define _RAC_TX_TX0DBMENPREDRVREG_MASK                                0x80UL                                            /**< Bit mask for RAC_TX0DBMENPREDRVREG          */
#define _RAC_TX_TX0DBMENPREDRVREG_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREG_disable                             0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREG_enable                              0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENPREDRVREG_DEFAULT                              (_RAC_TX_TX0DBMENPREDRVREG_DEFAULT << 7)          /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREG_disable                              (_RAC_TX_TX0DBMENPREDRVREG_disable << 7)          /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREG_enable                               (_RAC_TX_TX0DBMENPREDRVREG_enable << 7)           /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENPREDRVREGBIAS                                  (0x1UL << 8)                                      /**< TX0DBMENPREDRVREGBIAS                       */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_SHIFT                           8                                                 /**< Shift value for RAC_TX0DBMENPREDRVREGBIAS   */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_MASK                            0x100UL                                           /**< Bit mask for RAC_TX0DBMENPREDRVREGBIAS      */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_disable                         0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENPREDRVREGBIAS_enable                          0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENPREDRVREGBIAS_DEFAULT                          (_RAC_TX_TX0DBMENPREDRVREGBIAS_DEFAULT << 8)      /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREGBIAS_disable                          (_RAC_TX_TX0DBMENPREDRVREGBIAS_disable << 8)      /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENPREDRVREGBIAS_enable                           (_RAC_TX_TX0DBMENPREDRVREGBIAS_enable << 8)       /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENRAMPCLK                                        (0x1UL << 9)                                      /**< TX0DBMENRAMPCLK                             */
#define _RAC_TX_TX0DBMENRAMPCLK_SHIFT                                 9                                                 /**< Shift value for RAC_TX0DBMENRAMPCLK         */
#define _RAC_TX_TX0DBMENRAMPCLK_MASK                                  0x200UL                                           /**< Bit mask for RAC_TX0DBMENRAMPCLK            */
#define _RAC_TX_TX0DBMENRAMPCLK_DEFAULT                               0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENRAMPCLK_disable                               0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENRAMPCLK_enable                                0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENRAMPCLK_DEFAULT                                (_RAC_TX_TX0DBMENRAMPCLK_DEFAULT << 9)            /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENRAMPCLK_disable                                (_RAC_TX_TX0DBMENRAMPCLK_disable << 9)            /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENRAMPCLK_enable                                 (_RAC_TX_TX0DBMENRAMPCLK_enable << 9)             /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG                                 (0x1UL << 10)                                     /**< TX0DBMENBLEEDPREDRVREG                      */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_SHIFT                          10                                                /**< Shift value for RAC_TX0DBMENBLEEDPREDRVREG  */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_MASK                           0x400UL                                           /**< Bit mask for RAC_TX0DBMENBLEEDPREDRVREG     */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_DEFAULT                        0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_disable                        0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TX0DBMENBLEEDPREDRVREG_enable                         0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG_DEFAULT                         (_RAC_TX_TX0DBMENBLEEDPREDRVREG_DEFAULT << 10)    /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG_disable                         (_RAC_TX_TX0DBMENBLEEDPREDRVREG_disable << 10)    /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TX0DBMENBLEEDPREDRVREG_enable                          (_RAC_TX_TX0DBMENBLEEDPREDRVREG_enable << 10)     /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAENBLEEDPREDRVREG                                   (0x1UL << 12)                                     /**< TXPAENBLEEDPREDRVREG                        */
#define _RAC_TX_TXPAENBLEEDPREDRVREG_SHIFT                            12                                                /**< Shift value for RAC_TXPAENBLEEDPREDRVREG    */
#define _RAC_TX_TXPAENBLEEDPREDRVREG_MASK                             0x1000UL                                          /**< Bit mask for RAC_TXPAENBLEEDPREDRVREG       */
#define _RAC_TX_TXPAENBLEEDPREDRVREG_DEFAULT                          0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAENBLEEDPREDRVREG_disable                          0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAENBLEEDPREDRVREG_enable                           0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAENBLEEDPREDRVREG_DEFAULT                           (_RAC_TX_TXPAENBLEEDPREDRVREG_DEFAULT << 12)      /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAENBLEEDPREDRVREG_disable                           (_RAC_TX_TXPAENBLEEDPREDRVREG_disable << 12)      /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAENBLEEDPREDRVREG_enable                            (_RAC_TX_TXPAENBLEEDPREDRVREG_enable << 12)       /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAENBLEEDREG                                         (0x1UL << 13)                                     /**< TXPAENBLEEDREG                              */
#define _RAC_TX_TXPAENBLEEDREG_SHIFT                                  13                                                /**< Shift value for RAC_TXPAENBLEEDREG          */
#define _RAC_TX_TXPAENBLEEDREG_MASK                                   0x2000UL                                          /**< Bit mask for RAC_TXPAENBLEEDREG             */
#define _RAC_TX_TXPAENBLEEDREG_DEFAULT                                0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAENBLEEDREG_disable                                0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAENBLEEDREG_enable                                 0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAENBLEEDREG_DEFAULT                                 (_RAC_TX_TXPAENBLEEDREG_DEFAULT << 13)            /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAENBLEEDREG_disable                                 (_RAC_TX_TXPAENBLEEDREG_disable << 13)            /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAENBLEEDREG_enable                                  (_RAC_TX_TXPAENBLEEDREG_enable << 13)             /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAENPAOUT                                            (0x1UL << 14)                                     /**< TXPAENPAOUT                                 */
#define _RAC_TX_TXPAENPAOUT_SHIFT                                     14                                                /**< Shift value for RAC_TXPAENPAOUT             */
#define _RAC_TX_TXPAENPAOUT_MASK                                      0x4000UL                                          /**< Bit mask for RAC_TXPAENPAOUT                */
#define _RAC_TX_TXPAENPAOUT_DEFAULT                                   0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAENPAOUT_disable                                   0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAENPAOUT_enable                                    0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAENPAOUT_DEFAULT                                    (_RAC_TX_TXPAENPAOUT_DEFAULT << 14)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAENPAOUT_disable                                    (_RAC_TX_TXPAENPAOUT_disable << 14)               /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAENPAOUT_enable                                     (_RAC_TX_TXPAENPAOUT_enable << 14)                /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAENPREDRVREG                                        (0x1UL << 15)                                     /**< TXPAENPREDRVREG                             */
#define _RAC_TX_TXPAENPREDRVREG_SHIFT                                 15                                                /**< Shift value for RAC_TXPAENPREDRVREG         */
#define _RAC_TX_TXPAENPREDRVREG_MASK                                  0x8000UL                                          /**< Bit mask for RAC_TXPAENPREDRVREG            */
#define _RAC_TX_TXPAENPREDRVREG_DEFAULT                               0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAENPREDRVREG_disable                               0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAENPREDRVREG_enable                                0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAENPREDRVREG_DEFAULT                                (_RAC_TX_TXPAENPREDRVREG_DEFAULT << 15)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAENPREDRVREG_disable                                (_RAC_TX_TXPAENPREDRVREG_disable << 15)           /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAENPREDRVREG_enable                                 (_RAC_TX_TXPAENPREDRVREG_enable << 15)            /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_SYCHPBIASTRIMBUFTX                                     (0x1UL << 16)                                     /**< SYCHPBIASTRIMBUFTX                          */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_SHIFT                              16                                                /**< Shift value for RAC_SYCHPBIASTRIMBUFTX      */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_MASK                               0x10000UL                                         /**< Bit mask for RAC_SYCHPBIASTRIMBUFTX         */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_DEFAULT                            0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_10u                         0x00000000UL                                      /**< Mode i_tail_10u for RAC_TX                  */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_20u                         0x00000001UL                                      /**< Mode i_tail_20u for RAC_TX                  */
#define RAC_TX_SYCHPBIASTRIMBUFTX_DEFAULT                             (_RAC_TX_SYCHPBIASTRIMBUFTX_DEFAULT << 16)        /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_10u                          (_RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_10u << 16)     /**< Shifted mode i_tail_10u for RAC_TX          */
#define RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_20u                          (_RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_20u << 16)     /**< Shifted mode i_tail_20u for RAC_TX          */
#define RAC_TX_SYPFDCHPLPENTX                                         (0x1UL << 17)                                     /**< SYPFDCHPLPENTX                              */
#define _RAC_TX_SYPFDCHPLPENTX_SHIFT                                  17                                                /**< Shift value for RAC_SYPFDCHPLPENTX          */
