SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_rac.h
/* Bit fields for RAC PACTRL */
#define _RAC_PACTRL_RESETVALUE                                        0x00000000UL                                           /**< Default value for RAC_PACTRL                */
#define _RAC_PACTRL_MASK                                              0x0001FFFFUL                                           /**< Mask for RAC_PACTRL                         */
#define RAC_PACTRL_TX0DBMLATCHBYPASS                                  (0x1UL << 0)                                           /**< TX0DBMLATCHBYPASS                           */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_SHIFT                           0                                                      /**< Shift value for RAC_TX0DBMLATCHBYPASS       */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_MASK                            0x1UL                                                  /**< Bit mask for RAC_TX0DBMLATCHBYPASS          */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_DEFAULT                         0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_disable                         0x00000000UL                                           /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_enable                          0x00000001UL                                           /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_TX0DBMLATCHBYPASS_DEFAULT                          (_RAC_PACTRL_TX0DBMLATCHBYPASS_DEFAULT << 0)           /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMLATCHBYPASS_disable                          (_RAC_PACTRL_TX0DBMLATCHBYPASS_disable << 0)           /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMLATCHBYPASS_enable                           (_RAC_PACTRL_TX0DBMLATCHBYPASS_enable << 0)            /**< Shifted mode enable for RAC_PACTRL          */
#define RAC_PACTRL_TX0DBMSLICERESET                                   (0x1UL << 1)                                           /**< TX0DBMSLICERESET                            */
#define _RAC_PACTRL_TX0DBMSLICERESET_SHIFT                            1                                                      /**< Shift value for RAC_TX0DBMSLICERESET        */
#define _RAC_PACTRL_TX0DBMSLICERESET_MASK                             0x2UL                                                  /**< Bit mask for RAC_TX0DBMSLICERESET           */
#define _RAC_PACTRL_TX0DBMSLICERESET_DEFAULT                          0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMSLICERESET_active                           0x00000000UL                                           /**< Mode active for RAC_PACTRL                  */
#define _RAC_PACTRL_TX0DBMSLICERESET_reset                            0x00000001UL                                           /**< Mode reset for RAC_PACTRL                   */
#define RAC_PACTRL_TX0DBMSLICERESET_DEFAULT                           (_RAC_PACTRL_TX0DBMSLICERESET_DEFAULT << 1)            /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMSLICERESET_active                            (_RAC_PACTRL_TX0DBMSLICERESET_active << 1)             /**< Shifted mode active for RAC_PACTRL          */
#define RAC_PACTRL_TX0DBMSLICERESET_reset                             (_RAC_PACTRL_TX0DBMSLICERESET_reset << 1)              /**< Shifted mode reset for RAC_PACTRL           */
#define RAC_PACTRL_TXPABYPASSPREDRVREG                                (0x1UL << 2)                                           /**< TXPABYPASSPREDRVREG                         */
#define _RAC_PACTRL_TXPABYPASSPREDRVREG_SHIFT                         2                                                      /**< Shift value for RAC_TXPABYPASSPREDRVREG     */
#define _RAC_PACTRL_TXPABYPASSPREDRVREG_MASK                          0x4UL                                                  /**< Bit mask for RAC_TXPABYPASSPREDRVREG        */
#define _RAC_PACTRL_TXPABYPASSPREDRVREG_DEFAULT                       0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPABYPASSPREDRVREG_not_bypass                    0x00000000UL                                           /**< Mode not_bypass for RAC_PACTRL              */
#define _RAC_PACTRL_TXPABYPASSPREDRVREG_bypass                        0x00000001UL                                           /**< Mode bypass for RAC_PACTRL                  */
#define RAC_PACTRL_TXPABYPASSPREDRVREG_DEFAULT                        (_RAC_PACTRL_TXPABYPASSPREDRVREG_DEFAULT << 2)         /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPABYPASSPREDRVREG_not_bypass                     (_RAC_PACTRL_TXPABYPASSPREDRVREG_not_bypass << 2)      /**< Shifted mode not_bypass for RAC_PACTRL      */
#define RAC_PACTRL_TXPABYPASSPREDRVREG_bypass                         (_RAC_PACTRL_TXPABYPASSPREDRVREG_bypass << 2)          /**< Shifted mode bypass for RAC_PACTRL          */
#define RAC_PACTRL_TXPAPULLDOWNVDDPA                                  (0x1UL << 3)                                           /**< TXPAPULLDOWNVDDPA                           */
#define _RAC_PACTRL_TXPAPULLDOWNVDDPA_SHIFT                           3                                                      /**< Shift value for RAC_TXPAPULLDOWNVDDPA       */
#define _RAC_PACTRL_TXPAPULLDOWNVDDPA_MASK                            0x8UL                                                  /**< Bit mask for RAC_TXPAPULLDOWNVDDPA          */
#define _RAC_PACTRL_TXPAPULLDOWNVDDPA_DEFAULT                         0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPAPULLDOWNVDDPA_not_pull_down                   0x00000000UL                                           /**< Mode not_pull_down for RAC_PACTRL           */
#define _RAC_PACTRL_TXPAPULLDOWNVDDPA_pull_down_vddpa                 0x00000001UL                                           /**< Mode pull_down_vddpa for RAC_PACTRL         */
#define RAC_PACTRL_TXPAPULLDOWNVDDPA_DEFAULT                          (_RAC_PACTRL_TXPAPULLDOWNVDDPA_DEFAULT << 3)           /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPAPULLDOWNVDDPA_not_pull_down                    (_RAC_PACTRL_TXPAPULLDOWNVDDPA_not_pull_down << 3)     /**< Shifted mode not_pull_down for RAC_PACTRL   */
#define RAC_PACTRL_TXPAPULLDOWNVDDPA_pull_down_vddpa                  (_RAC_PACTRL_TXPAPULLDOWNVDDPA_pull_down_vddpa << 3)   /**< Shifted mode pull_down_vddpa for RAC_PACTRL */
#define _RAC_PACTRL_TXPAPOWER_SHIFT                                   4                                                      /**< Shift value for RAC_TXPAPOWER               */
#define _RAC_PACTRL_TXPAPOWER_MASK                                    0xF0UL                                                 /**< Bit mask for RAC_TXPAPOWER                  */
#define _RAC_PACTRL_TXPAPOWER_DEFAULT                                 0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPAPOWER_t0stripeon                              0x00000000UL                                           /**< Mode t0stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t1stripeon                              0x00000001UL                                           /**< Mode t1stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t2stripeon                              0x00000002UL                                           /**< Mode t2stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t3stripeon                              0x00000003UL                                           /**< Mode t3stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t4stripeon                              0x00000004UL                                           /**< Mode t4stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t5stripeon                              0x00000005UL                                           /**< Mode t5stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t6stripeon                              0x00000006UL                                           /**< Mode t6stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t7stripeon                              0x00000007UL                                           /**< Mode t7stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t8stripeon                              0x00000008UL                                           /**< Mode t8stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t9stripeon                              0x00000009UL                                           /**< Mode t9stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_TXPAPOWER_t10stripeon                             0x0000000AUL                                           /**< Mode t10stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_TXPAPOWER_t11stripeon                             0x0000000BUL                                           /**< Mode t11stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_TXPAPOWER_t12stripeon                             0x0000000CUL                                           /**< Mode t12stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_TXPAPOWER_t13stripeon                             0x0000000DUL                                           /**< Mode t13stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_TXPAPOWER_t14stripeon                             0x0000000EUL                                           /**< Mode t14stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_TXPAPOWER_t15stripeon                             0x0000000FUL                                           /**< Mode t15stripeon for RAC_PACTRL             */
#define RAC_PACTRL_TXPAPOWER_DEFAULT                                  (_RAC_PACTRL_TXPAPOWER_DEFAULT << 4)                   /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPAPOWER_t0stripeon                               (_RAC_PACTRL_TXPAPOWER_t0stripeon << 4)                /**< Shifted mode t0stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t1stripeon                               (_RAC_PACTRL_TXPAPOWER_t1stripeon << 4)                /**< Shifted mode t1stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t2stripeon                               (_RAC_PACTRL_TXPAPOWER_t2stripeon << 4)                /**< Shifted mode t2stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t3stripeon                               (_RAC_PACTRL_TXPAPOWER_t3stripeon << 4)                /**< Shifted mode t3stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t4stripeon                               (_RAC_PACTRL_TXPAPOWER_t4stripeon << 4)                /**< Shifted mode t4stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t5stripeon                               (_RAC_PACTRL_TXPAPOWER_t5stripeon << 4)                /**< Shifted mode t5stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t6stripeon                               (_RAC_PACTRL_TXPAPOWER_t6stripeon << 4)                /**< Shifted mode t6stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t7stripeon                               (_RAC_PACTRL_TXPAPOWER_t7stripeon << 4)                /**< Shifted mode t7stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t8stripeon                               (_RAC_PACTRL_TXPAPOWER_t8stripeon << 4)                /**< Shifted mode t8stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t9stripeon                               (_RAC_PACTRL_TXPAPOWER_t9stripeon << 4)                /**< Shifted mode t9stripeon for RAC_PACTRL      */
#define RAC_PACTRL_TXPAPOWER_t10stripeon                              (_RAC_PACTRL_TXPAPOWER_t10stripeon << 4)               /**< Shifted mode t10stripeon for RAC_PACTRL     */
#define RAC_PACTRL_TXPAPOWER_t11stripeon                              (_RAC_PACTRL_TXPAPOWER_t11stripeon << 4)               /**< Shifted mode t11stripeon for RAC_PACTRL     */
#define RAC_PACTRL_TXPAPOWER_t12stripeon                              (_RAC_PACTRL_TXPAPOWER_t12stripeon << 4)               /**< Shifted mode t12stripeon for RAC_PACTRL     */
#define RAC_PACTRL_TXPAPOWER_t13stripeon                              (_RAC_PACTRL_TXPAPOWER_t13stripeon << 4)               /**< Shifted mode t13stripeon for RAC_PACTRL     */
#define RAC_PACTRL_TXPAPOWER_t14stripeon                              (_RAC_PACTRL_TXPAPOWER_t14stripeon << 4)               /**< Shifted mode t14stripeon for RAC_PACTRL     */
#define RAC_PACTRL_TXPAPOWER_t15stripeon                              (_RAC_PACTRL_TXPAPOWER_t15stripeon << 4)               /**< Shifted mode t15stripeon for RAC_PACTRL     */
#define RAC_PACTRL_TXPALATCHBYPASS10DBM                               (0x1UL << 8)                                           /**< TXPALATCHBYPASS10DBM                        */
#define _RAC_PACTRL_TXPALATCHBYPASS10DBM_SHIFT                        8                                                      /**< Shift value for RAC_TXPALATCHBYPASS10DBM    */
#define _RAC_PACTRL_TXPALATCHBYPASS10DBM_MASK                         0x100UL                                                /**< Bit mask for RAC_TXPALATCHBYPASS10DBM       */
#define _RAC_PACTRL_TXPALATCHBYPASS10DBM_DEFAULT                      0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPALATCHBYPASS10DBM_disable                      0x00000000UL                                           /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPALATCHBYPASS10DBM_enable                       0x00000001UL                                           /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_TXPALATCHBYPASS10DBM_DEFAULT                       (_RAC_PACTRL_TXPALATCHBYPASS10DBM_DEFAULT << 8)        /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPALATCHBYPASS10DBM_disable                       (_RAC_PACTRL_TXPALATCHBYPASS10DBM_disable << 8)        /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_TXPALATCHBYPASS10DBM_enable                        (_RAC_PACTRL_TXPALATCHBYPASS10DBM_enable << 8)         /**< Shifted mode enable for RAC_PACTRL          */
#define RAC_PACTRL_TXPALATCHBYPASS20DBM                               (0x1UL << 9)                                           /**< TXPALATCHBYPASS20DBM                        */
#define _RAC_PACTRL_TXPALATCHBYPASS20DBM_SHIFT                        9                                                      /**< Shift value for RAC_TXPALATCHBYPASS20DBM    */
#define _RAC_PACTRL_TXPALATCHBYPASS20DBM_MASK                         0x200UL                                                /**< Bit mask for RAC_TXPALATCHBYPASS20DBM       */
#define _RAC_PACTRL_TXPALATCHBYPASS20DBM_DEFAULT                      0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPALATCHBYPASS20DBM_disable                      0x00000000UL                                           /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPALATCHBYPASS20DBM_enable                       0x00000001UL                                           /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_TXPALATCHBYPASS20DBM_DEFAULT                       (_RAC_PACTRL_TXPALATCHBYPASS20DBM_DEFAULT << 9)        /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPALATCHBYPASS20DBM_disable                       (_RAC_PACTRL_TXPALATCHBYPASS20DBM_disable << 9)        /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_TXPALATCHBYPASS20DBM_enable                        (_RAC_PACTRL_TXPALATCHBYPASS20DBM_enable << 9)         /**< Shifted mode enable for RAC_PACTRL          */
#define RAC_PACTRL_TXPASELPREDRVREGVDDPA                              (0x1UL << 10)                                          /**< TXPASELPREDRVREGVDDPA                       */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDPA_SHIFT                       10                                                     /**< Shift value for RAC_TXPASELPREDRVREGVDDPA   */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDPA_MASK                        0x400UL                                                /**< Bit mask for RAC_TXPASELPREDRVREGVDDPA      */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDPA_DEFAULT                     0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDPA_not_selected                0x00000000UL                                           /**< Mode not_selected for RAC_PACTRL            */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDPA_selected                    0x00000001UL                                           /**< Mode selected for RAC_PACTRL                */
#define RAC_PACTRL_TXPASELPREDRVREGVDDPA_DEFAULT                      (_RAC_PACTRL_TXPASELPREDRVREGVDDPA_DEFAULT << 10)      /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPASELPREDRVREGVDDPA_not_selected                 (_RAC_PACTRL_TXPASELPREDRVREGVDDPA_not_selected << 10) /**< Shifted mode not_selected for RAC_PACTRL    */
#define RAC_PACTRL_TXPASELPREDRVREGVDDPA_selected                     (_RAC_PACTRL_TXPASELPREDRVREGVDDPA_selected << 10)     /**< Shifted mode selected for RAC_PACTRL        */
#define RAC_PACTRL_TXPASELPREDRVREGVDDRF                              (0x1UL << 11)                                          /**< TXPASELPREDRVREGVDDRF                       */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDRF_SHIFT                       11                                                     /**< Shift value for RAC_TXPASELPREDRVREGVDDRF   */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDRF_MASK                        0x800UL                                                /**< Bit mask for RAC_TXPASELPREDRVREGVDDRF      */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDRF_DEFAULT                     0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDRF_not_selected                0x00000000UL                                           /**< Mode not_selected for RAC_PACTRL            */
#define _RAC_PACTRL_TXPASELPREDRVREGVDDRF_selected                    0x00000001UL                                           /**< Mode selected for RAC_PACTRL                */
#define RAC_PACTRL_TXPASELPREDRVREGVDDRF_DEFAULT                      (_RAC_PACTRL_TXPASELPREDRVREGVDDRF_DEFAULT << 11)      /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPASELPREDRVREGVDDRF_not_selected                 (_RAC_PACTRL_TXPASELPREDRVREGVDDRF_not_selected << 11) /**< Shifted mode not_selected for RAC_PACTRL    */
#define RAC_PACTRL_TXPASELPREDRVREGVDDRF_selected                     (_RAC_PACTRL_TXPASELPREDRVREGVDDRF_selected << 11)     /**< Shifted mode selected for RAC_PACTRL        */
#define _RAC_PACTRL_TXPASELSLICE_SHIFT                                12                                                     /**< Shift value for RAC_TXPASELSLICE            */
#define _RAC_PACTRL_TXPASELSLICE_MASK                                 0xF000UL                                               /**< Bit mask for RAC_TXPASELSLICE               */
#define _RAC_PACTRL_TXPASELSLICE_DEFAULT                              0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define RAC_PACTRL_TXPASELSLICE_DEFAULT                               (_RAC_PACTRL_TXPASELSLICE_DEFAULT << 12)               /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPASLICERST                                       (0x1UL << 16)                                          /**< TXPASLICERST                                */
#define _RAC_PACTRL_TXPASLICERST_SHIFT                                16                                                     /**< Shift value for RAC_TXPASLICERST            */
#define _RAC_PACTRL_TXPASLICERST_MASK                                 0x10000UL                                              /**< Bit mask for RAC_TXPASLICERST               */
#define _RAC_PACTRL_TXPASLICERST_DEFAULT                              0x00000000UL                                           /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPASLICERST_disable                              0x00000000UL                                           /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_TXPASLICERST_enable                               0x00000001UL                                           /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_TXPASLICERST_DEFAULT                               (_RAC_PACTRL_TXPASLICERST_DEFAULT << 16)               /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TXPASLICERST_disable                               (_RAC_PACTRL_TXPASLICERST_disable << 16)               /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_TXPASLICERST_enable                                (_RAC_PACTRL_TXPASLICERST_enable << 16)                /**< Shifted mode enable for RAC_PACTRL          */

/* Bit fields for RAC FENOTCH0 */
#define _RAC_FENOTCH0_RESETVALUE                                      0x00004000UL                               /**< Default value for RAC_FENOTCH0              */
#define _RAC_FENOTCH0_MASK                                            0x00007000UL                               /**< Mask for RAC_FENOTCH0                       */
#define _RAC_FENOTCH0_FENOTCHVBIAS_SHIFT                              12                                         /**< Shift value for RAC_FENOTCHVBIAS            */
#define _RAC_FENOTCH0_FENOTCHVBIAS_MASK                               0x7000UL                                   /**< Bit mask for RAC_FENOTCHVBIAS               */
#define _RAC_FENOTCH0_FENOTCHVBIAS_DEFAULT                            0x00000004UL                               /**< Mode DEFAULT for RAC_FENOTCH0               */
#define RAC_FENOTCH0_FENOTCHVBIAS_DEFAULT                             (_RAC_FENOTCH0_FENOTCHVBIAS_DEFAULT << 12) /**< Shifted mode DEFAULT for RAC_FENOTCH0       */

